const _generator = require('.')
const fs = require('fs')

// 使用 configure 方法重新配置
const generator = _generator.configure({
  linkLayerType: 150, // 自定义 linkLayerType
  // 其他配置项
});


// protocolCode, basicProtocol, connectIndex, roundIndex
const ipPackets = [
  {
    connectIndex: 1,
    roundIndex: 7,
    timestamp: Date.now(),
    buffer: Buffer.from([71, 69, 84, 32, 47, 32, 72, 84, 84, 80, 47, 49, 46, 49, 13, 10, 65, 99, 99, 101, 112, 116, 58, 32, 42, 47, 42, 13, 10, 65, 99, 99, 101, 115, 115, 45, 67, 111, 110, 116, 114, 111, 108, 45, 82, 101, 113, 117, 101, 115, 116, 45, 77, 101, 116, 104, 111, 100, 58, 32, 84, 104, 101, 32, 113, 117, 105, 99, 8, 8, 8, 8, 8, 8, 107, 32, 98, 114, 111, 119, 110, 32, 102, 111, 7, 13, 10, 72, 111, 115, 116, 58, 32, 108, 111, 99, 97, 108, 104, 111, 115, 116, 58, 56, 48, 48, 48, 13, 10, 85, 115, 101, 114, 45, 65, 103, 101, 110, 116, 58, 32, 119, 105, 110, 103, 102, 117, 122, 122, 13, 10, 13, 10]),
  },
  {
    connectIndex: 128,
    roundIndex: 8,
    timestamp: Date.now(),
    buffer: Buffer.from([71, 69, 84, 32, 47, 32, 72, 84, 84, 80, 47, 49, 46, 49, 13, 10, 65, 99, 99, 101, 112, 116, 58, 32, 42, 47, 42, 13, 10, 65, 99, 99, 101, 115, 115, 45, 67, 111, 110, 116, 114, 111, 108, 45, 82, 101, 113, 117, 101, 115, 116, 45, 77, 101, 116, 104, 111, 100, 58, 32, 84, 104, 101, 32, 113, 117, 105, 99, 8, 8, 8, 8, 8, 8, 107, 32, 98, 114, 111, 119, 110, 32, 102, 111, 7, 13, 10, 72, 111, 115, 116, 58, 32, 108, 111, 99, 97, 108, 104, 111, 115, 116, 58, 56, 48, 48, 48, 13, 10, 85, 115, 101, 114, 45, 65, 103, 101, 110, 116, 58, 32, 119, 105, 110, 103, 102, 117, 122, 122, 13, 10, 13, 10]),
  }
]

const pcapFile = generator(ipPackets)

fs.writeFileSync('out.pcap', pcapFile)
console.log('Open test.pcap in Wireshark')

/** 

1. pcap的linklayertype = 150（属于Private Use范围）
2. 每个数据包前增加一个头,长度为8字节：

* 2字节的协议字段：先填0,代表unknown，未来每个协议可以给一个编号
* 1字节的基础协议字段：先填0,代表unknown，未来每个基础协议可以给一个编号（TCP/UDP这种），复现工具可以检查这个字段来确定是否使用了正确的工具。
* 1字节的connect_index：连接序号（0-127为发出的数据包,128-255为接收的数据包，也就是说第一个bit为0为发送，为1为接收）
* 4字节的round_index：轮次序号

导出工具：不管是单选还是多选，都按照上述的逻辑导出。并且收到的数据包也会导出，供用户查看。
复现工具：检查linklayertype，如果是150，则按照上述逻辑解析（保证轮次和连接）；如果不是150，则保持现有逻辑不变（不一定保证轮次和连接）

*/